БухЭксп/Catalogs/CW_ПодключаемыеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПодключаемыеФормы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодключаемыйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъектаМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПодключаемыеФормы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПодключаемыеФормы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ПодключаемыеФормы КАК CW_ПодключаемыеФормы
	               |ГДЕ
	               |	CW_ПодключаемыеФормы.ПодключаемыйОбъект = &ПодключаемыйОбъект
	               |	И CW_ПодключаемыеФормы.ИдентификаторОбъектаМетаданных = &ИдентификаторОбъектаМетаданных
	               |	И CW_ПодключаемыеФормы.Ссылка <> &Ссылка
	               |	И CW_ПодключаемыеФормы.НеИспользуется = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Ссылка"							, ТекущийОбъект.Ссылка);
	Запрос.УстановитьПараметр("ПодключаемыйОбъект"				, ТекущийОбъект.ПодключаемыйОбъект);
	Запрос.УстановитьПараметр("ИдентификаторОбъектаМетаданных"	, ТекущийОбъект.ИдентификаторОбъектаМетаданных);
	
	РезульатаЗапроса = Запрос.Выполнить();
	
	Отказ = Не РезульатаЗапроса.Пустой();
	
	Если Отказ Тогда
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст = "Для указанного объекта метаданных уже есть подключенная форма";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйОбъектПриИзменении(Элемент)
	
	ОбработатьИзменениеОбъектаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеОбъектаНаСервере()
	
	
	ИмяМетаданного =  Справочники.CW_ПодключаемыеФормы.ПолучитьИмяМетаданногоПодключаемойФормы(Объект.ПодключаемыйОбъект);
	
	Если ИмяМетаданного <> Неопределено Тогда
		Объект.ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ИмяМетаданного);
	КонецЕсли;
	
КонецПроцедуры
